; domain
(define (domain blocksworld)
  (:requirements :strips)
(:predicates (clear ?x)
             (on-table ?x)
             (arm-empty)
             (holding ?x)
             (on ?x ?y))

(:action pickup
  :parameters (?ob)
  :precondition (and (clear ?ob) (on-table ?ob) (arm-empty))
  :effect (and (holding ?ob) (not (clear ?ob)) (not (on-table ?ob))
               (not (arm-empty))))

(:action putdown
  :parameters  (?ob)
  :precondition (holding ?ob)
  :effect (and (clear ?ob) (arm-empty) (on-table ?ob)
               (not (holding ?ob))))

(:action stack
  :parameters  (?ob ?underob)
  :precondition (and (clear ?underob) (holding ?ob))
  :effect (and (arm-empty) (clear ?ob) (on ?ob ?underob)
               (not (clear ?underob)) (not (holding ?ob))))

(:action unstack
  :parameters  (?ob ?underob)
  :precondition (and (on ?ob ?underob) (clear ?ob) (arm-empty))
  :effect (and (holding ?ob) (clear ?underob)
               (not (on ?ob ?underob)) (not (clear ?ob)) (not (arm-empty)))))

; problem
;; blocks=177, out_folder=htg/blocksworld/training, instance_id=19, seed=2043, goal_proportion=0.03

(define (problem blocksworld-19)
 (:domain blocksworld)
 (:objects b1 b2 b3 b4 b5 b6 b7 b8 b9 b10 b11 b12 b13 b14 b15 b16 b17 b18 b19 b20 b21 b22 b23 b24 b25 b26 b27 b28 b29 b30 b31 b32 b33 b34 b35 b36 b37 b38 b39 b40 b41 b42 b43 b44 b45 b46 b47 b48 b49 b50 b51 b52 b53 b54 b55 b56 b57 b58 b59 b60 b61 b62 b63 b64 b65 b66 b67 b68 b69 b70 b71 b72 b73 b74 b75 b76 b77 b78 b79 b80 b81 b82 b83 b84 b85 b86 b87 b88 b89 b90 b91 b92 b93 b94 b95 b96 b97 b98 b99 b100 b101 b102 b103 b104 b105 b106 b107 b108 b109 b110 b111 b112 b113 b114 b115 b116 b117 b118 b119 b120 b121 b122 b123 b124 b125 b126 b127 b128 b129 b130 b131 b132 b133 b134 b135 b136 b137 b138 b139 b140 b141 b142 b143 b144 b145 b146 b147 b148 b149 b150 b151 b152 b153 b154 b155 b156 b157 b158 b159 b160 b161 b162 b163 b164 b165 b166 b167 b168 b169 b170 b171 b172 b173 b174 b175 b176 b177 - object)
 (:init 
    (arm-empty)
    (clear b117)
    (on b117 b107)
    (on b107 b110)
    (on b110 b70)
    (on b70 b135)
    (on b135 b76)
    (on-table b76)
    (clear b1)
    (on-table b1)
    (clear b168)
    (on b168 b89)
    (on b89 b47)
    (on b47 b155)
    (on b155 b172)
    (on b172 b3)
    (on b3 b38)
    (on b38 b115)
    (on b115 b93)
    (on b93 b14)
    (on-table b14)
    (clear b45)
    (on b45 b123)
    (on b123 b44)
    (on-table b44)
    (clear b106)
    (on-table b106)
    (clear b18)
    (on-table b18)
    (clear b102)
    (on-table b102)
    (clear b140)
    (on b140 b147)
    (on b147 b154)
    (on-table b154)
    (clear b5)
    (on-table b5)
    (clear b29)
    (on-table b29)
    (clear b105)
    (on b105 b128)
    (on b128 b66)
    (on-table b66)
    (clear b78)
    (on b78 b88)
    (on b88 b177)
    (on b177 b51)
    (on-table b51)
    (clear b103)
    (on-table b103)
    (clear b139)
    (on b139 b100)
    (on-table b100)
    (clear b49)
    (on b49 b121)
    (on-table b121)
    (clear b74)
    (on b74 b166)
    (on b166 b46)
    (on b46 b52)
    (on b52 b157)
    (on-table b157)
    (clear b129)
    (on b129 b15)
    (on b15 b53)
    (on b53 b4)
    (on b4 b31)
    (on b31 b174)
    (on b174 b54)
    (on-table b54)
    (clear b150)
    (on b150 b77)
    (on b77 b48)
    (on b48 b24)
    (on b24 b119)
    (on-table b119)
    (clear b176)
    (on b176 b2)
    (on b2 b64)
    (on b64 b98)
    (on-table b98)
    (clear b167)
    (on b167 b132)
    (on b132 b126)
    (on b126 b27)
    (on-table b27)
    (clear b136)
    (on b136 b133)
    (on b133 b19)
    (on-table b19)
    (clear b130)
    (on b130 b67)
    (on b67 b26)
    (on-table b26)
    (clear b146)
    (on-table b146)
    (clear b175)
    (on-table b175)
    (clear b91)
    (on b91 b134)
    (on b134 b6)
    (on b6 b122)
    (on b122 b12)
    (on-table b12)
    (clear b81)
    (on b81 b43)
    (on-table b43)
    (clear b153)
    (on b153 b62)
    (on b62 b30)
    (on-table b30)
    (clear b169)
    (on b169 b160)
    (on b160 b104)
    (on b104 b127)
    (on b127 b161)
    (on b161 b156)
    (on b156 b111)
    (on b111 b59)
    (on b59 b99)
    (on b99 b41)
    (on b41 b42)
    (on b42 b23)
    (on b23 b33)
    (on b33 b56)
    (on-table b56)
    (clear b9)
    (on-table b9)
    (clear b61)
    (on b61 b125)
    (on b125 b142)
    (on-table b142)
    (clear b158)
    (on b158 b96)
    (on b96 b55)
    (on-table b55)
    (clear b36)
    (on b36 b71)
    (on b71 b39)
    (on b39 b138)
    (on-table b138)
    (clear b109)
    (on b109 b7)
    (on-table b7)
    (clear b79)
    (on-table b79)
    (clear b20)
    (on b20 b40)
    (on b40 b35)
    (on b35 b95)
    (on-table b95)
    (clear b60)
    (on-table b60)
    (clear b87)
    (on b87 b75)
    (on b75 b85)
    (on-table b85)
    (clear b50)
    (on b50 b32)
    (on-table b32)
    (clear b151)
    (on-table b151)
    (clear b13)
    (on-table b13)
    (clear b97)
    (on b97 b8)
    (on b8 b162)
    (on-table b162)
    (clear b149)
    (on b149 b164)
    (on-table b164)
    (clear b94)
    (on b94 b83)
    (on b83 b86)
    (on-table b86)
    (clear b28)
    (on b28 b10)
    (on b10 b57)
    (on-table b57)
    (clear b152)
    (on-table b152)
    (clear b21)
    (on b21 b90)
    (on-table b90)
    (clear b101)
    (on b101 b73)
    (on b73 b22)
    (on b22 b145)
    (on b145 b80)
    (on-table b80)
    (clear b114)
    (on b114 b58)
    (on-table b58)
    (clear b137)
    (on b137 b84)
    (on b84 b173)
    (on-table b173)
    (clear b16)
    (on-table b16)
    (clear b17)
    (on b17 b11)
    (on-table b11)
    (clear b113)
    (on b113 b82)
    (on b82 b69)
    (on b69 b65)
    (on-table b65)
    (clear b116)
    (on-table b116)
    (clear b25)
    (on-table b25)
    (clear b141)
    (on-table b141)
    (clear b72)
    (on b72 b112)
    (on-table b112)
    (clear b92)
    (on-table b92)
    (clear b120)
    (on b120 b37)
    (on b37 b131)
    (on b131 b68)
    (on-table b68)
    (clear b118)
    (on b118 b163)
    (on b163 b34)
    (on b34 b108)
    (on-table b108)
    (clear b165)
    (on b165 b144)
    (on-table b144)
    (clear b143)
    (on-table b143)
    (clear b148)
    (on b148 b170)
    (on b170 b171)
    (on-table b171)
    (clear b63)
    (on b63 b159)
    (on b159 b124)
    (on-table b124))
 (:goal  (and 
    (clear b1)
    (on-table b1)
    (clear b2)
    (on b2 b3)
    (on b3 b4)
    (on-table b4)
    (clear b5)
    (on-table b5))))

; plan
1. (unstack b129 b15)
   deleted: (on b129 b15) (clear b129) (arm-empty)
   added: (holding b129) (clear b15)
   goals met: 4 of 8
2. (putdown b129)
   deleted: (holding b129)
   added: (clear b129) (arm-empty) (on-table b129)
   goals met: 4 of 8
3. (unstack b15 b53)
   deleted: (on b15 b53) (clear b15) (arm-empty)
   added: (holding b15) (clear b53)
   goals met: 4 of 8
4. (putdown b15)
   deleted: (holding b15)
   added: (clear b15) (arm-empty) (on-table b15)
   goals met: 4 of 8
5. (unstack b168 b89)
   deleted: (on b168 b89) (clear b168) (arm-empty)
   added: (holding b168) (clear b89)
   goals met: 4 of 8
6. (putdown b168)
   deleted: (holding b168)
   added: (clear b168) (arm-empty) (on-table b168)
   goals met: 4 of 8
7. (unstack b176 b2)
   deleted: (on b176 b2) (clear b176) (arm-empty)
   added: (holding b176) (clear b2)
   goals met: 5 of 8
8. (putdown b176)
   deleted: (holding b176)
   added: (clear b176) (arm-empty) (on-table b176)
   goals met: 5 of 8
9. (unstack b53 b4)
   deleted: (on b53 b4) (clear b53) (arm-empty)
   added: (holding b53) (clear b4)
   goals met: 5 of 8
10. (putdown b53)
   deleted: (holding b53)
   added: (clear b53) (arm-empty) (on-table b53)
   goals met: 5 of 8
11. (unstack b4 b31)
   deleted: (on b4 b31) (clear b4) (arm-empty)
   added: (holding b4) (clear b31)
   goals met: 5 of 8
12. (putdown b4)
   deleted: (holding b4)
   added: (clear b4) (arm-empty) (on-table b4)
   goals met: 6 of 8
13. (unstack b89 b47)
   deleted: (on b89 b47) (clear b89) (arm-empty)
   added: (holding b89) (clear b47)
   goals met: 6 of 8
14. (putdown b89)
   deleted: (holding b89)
   added: (clear b89) (arm-empty) (on-table b89)
   goals met: 6 of 8
15. (unstack b47 b155)
   deleted: (on b47 b155) (clear b47) (arm-empty)
   added: (holding b47) (clear b155)
   goals met: 6 of 8
16. (putdown b47)
   deleted: (holding b47)
   added: (clear b47) (arm-empty) (on-table b47)
   goals met: 6 of 8
17. (unstack b155 b172)
   deleted: (on b155 b172) (clear b155) (arm-empty)
   added: (holding b155) (clear b172)
   goals met: 6 of 8
18. (putdown b155)
   deleted: (holding b155)
   added: (clear b155) (arm-empty) (on-table b155)
   goals met: 6 of 8
19. (unstack b172 b3)
   deleted: (on b172 b3) (clear b172) (arm-empty)
   added: (holding b172) (clear b3)
   goals met: 6 of 8
20. (putdown b172)
   deleted: (holding b172)
   added: (clear b172) (arm-empty) (on-table b172)
   goals met: 6 of 8
21. (unstack b3 b38)
   deleted: (on b3 b38) (clear b3) (arm-empty)
   added: (holding b3) (clear b38)
   goals met: 6 of 8
22. (stack b3 b4)
   deleted: (clear b4) (holding b3)
   added: (arm-empty) (clear b3) (on b3 b4)
   goals met: 7 of 8
23. (unstack b2 b64)
   deleted: (on b2 b64) (clear b2) (arm-empty)
   added: (holding b2) (clear b64)
   goals met: 6 of 8
24. (stack b2 b3)
   deleted: (clear b3) (holding b2)
   added: (arm-empty) (clear b2) (on b2 b3)
   goals met: 8 of 8
